<?php

function url_amigavel($texto) {
    $caracteres_especiais = array('ä', 'ã', 'à', 'á', 'â', 'ê', 'ë', 'è', 'é', 'ï', 'ì', 'í', 'ö', 'õ', 'ò', 'ó', 'ô', 'ü', 'ù', 'ú', 'û', 'À', 'Á', 'Ã', 'É', 'Ê', 'Í', 'Ó', 'Ú', 'ñ', 'Ñ', 'ç', 'Ç', 'Õ', '-', '(', ')', '.', ',', ';', ':', '|', '!', '"', '#', '$', '%', '&', '/', '=', '?', '~', '^', '>', '<', 'ª', 'º', ' "', '" ', "'", ' ', '--');
    $substitui_para = array('a', 'a', 'a', 'a', 'a', 'e', 'e', 'e', 'e', 'i', 'i', 'i', 'o', 'o', 'o', 'o', 'o', 'u', 'u', 'u', 'u', 'A', 'A', 'A', 'E', 'E', 'I', 'O', 'U', 'n', 'n', 'c', 'C', 'O', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '-', '-');
    return strtolower(str_replace($caracteres_especiais, $substitui_para, $texto));
}
